/******************************************************************************************************
** Created by:			TanMuLiang
** Created date:		2007-01-26
** Version:				1.0
** Descriptions:		The original version
*******************************************************************************************************/

#ifndef __COMM_H__
#define __COMM_H__
//485
#define    RS485_TERE     	1<<10

//////////// UART   /////////////////////
#define     COM0   	0	//串口0
#define     COM1   	1	//串口1
#define 	COMB	2	//两个串口
typedef  void (*pREVFUNC)(void *pBuff,uint16 nlen);//串口回调函数
typedef struct tagDCB
{
	uint32 		baudrate;				// 波特率
	char 		datab;		    			// 字长度，5/6/7/8可选
	char 		stopb;		    			// 停止位，1/2可选
	char 		parity;		    			// 奇偶校验位，0-无校验,1-奇校验,2-偶校验
	char 		ruf;						// 保留
	uint16 		limitlen;					// 长度阀值
	uint32 		timeout;					// 接收超时时限
	pREVFUNC 	pRecvfuc;				// 接收回调函数
}DCB,*pDCB;

/*
*********************************************************************************************************
** 函数名称 ：StartComm()
** 函数功能 ：串口初始化,设置串口0、1的速率、位数、停止位、奇偶校验位
** 入口参数 ：pComData :设置串口0、1，lBaudBate :速率，cBits :数据位数，cStop :停止位数，cParty :奇校验位数等
** 出口参数 ：无
** 返    回 ：无
*********************************************************************************************************
*/
void StartComm(uint8 COM,pDCB pComData);

/*
*********************************************************************************************************
** 函数名称 ：COM_SendBuf()
** 函数功能 ：向串口发送n字节数据
** 入口参数 ：dat	要发送的数据
** 出口参数 ：无
** 返    回 : 0 : 表示不成功， 1 : 表示成功
*********************************************************************************************************
*/
uint8 COM_SendBuf(uint8 uComm,uint8 *pcSendBuf, int iLen);

#endif
