#ifndef __PSAM_H__
#define __PSAM_H__

// 函数
/*
*********************************************************************************************************
** 函数名称 ：Init_Psam
** 函数功能 ：初始化psam卡
** 入口参数 : 无
** 出口参数 ：无
*********************************************************************************************************
*/
extern void Init_Psam(void);
/*
************************************************************************************
** 函数名称:Rst_Psam_Card
** 函数功能: 复位PSAM_Card                         
** 入口参数:
** 出口参数:cData:复位信息cLen:复位信息长度s
** 返回 	：1表示成功, 0表示失败
*************************************************************************************
*/
extern uint8  Rst_Psam_Card(uint8 *cData, uint8 *cLen);


/*
**********************************************************************************
对底层psam卡熟悉的客户可通过本函数组包向psam卡接收数据和得到psam卡的返回数据

**		参数：
**		pSData :发送数据指针，cSNum：发送数据长度
**		pRData :接收数据指针，cRNum：接收数据长度指针
**		cChannel:那张psam卡0为第一张psam卡,1为第2张psam卡
**		返回：
**		操作状态码
***********************************************************************************
*/
extern uint16 CosCommand(unsigned char *pSData,unsigned char,unsigned char *pRData,unsigned char *cRNum);



#endif
